import math

# Задание 1
a = int(input("Введите число для Задания №1: "))
a *= 16

print("Ответ: " + str(a))
print("---------------------")

# Задание 2
a = int(input("Введите число для Задания №2: "))
a = (a * math.log(10,2)) / 0.5

if (a // 1) % 2 == 0:
    a //= 1
    a += 2
else:
    a //= 1 
    a += 1

print("Ответ: " + str(int(a)))
